Расширения/ПроцедурыИФункцииОбщихМодулейКонфигурации/Catalogs/АМ_ТипыЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>АМ_ТипыЗначений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Списочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Расширения/ПроцедурыИФункцииОбщихМодулейКонфигурации/CommonModules/АМ_РаботаСТекстомПроцедурИФункцийСерверПовторноеИспользование/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ТаблицаОсновныхТипов() Экспорт 
	ЗапросПоОсновнымТипам = Новый Запрос;
	ЗапросПоОсновнымТипам.Текст = "ВЫБРАТЬ
	                              |	АМ_ТипыЗначений.Наименование КАК Наименование,
	                              |	АМ_ТипыЗначений.Списочный КАК Списочный,
	                              |	АМ_ТипыЗначений.Ссылка КАК Ссылка
	                              |ИЗ
	                              |	Справочник.АМ_ТипыЗначений КАК АМ_ТипыЗначений
	                              |ГДЕ
	                              |	НЕ АМ_ТипыЗначений.ПометкаУдаления
	                              |	И АМ_ТипыЗначений.Типовой";
	ТаблицаТипов = ЗапросПоОсновнымТипам.Выполнить().Выгрузить();
	

	Возврат ТаблицаТипов;
	
КонецФункции
 
#КонецОбласти
